Importamos pandas y creamos un dataFrame simple

In [25]:
import pandas as pd

df1 = pd.DataFrame(
     {
         "Nombre": ["Ana", "Pepe", "Hugo", "Maria"],
         "Apellido": ["Sanchez", "Lopez", "Hernandez", "Gonzalez"],
         "edad": ["26", "31", "19", "22"],
         "puesto": ["junior dev", "Senior dev", "Practicante", "PM"],
     },
     #index=[0, 1, 2, 3],
 )

In [26]:
df1

  Nombre   Apellido edad       puesto
0    Ana    Sanchez   26   junior dev
1   Pepe      Lopez   31   Senior dev
2   Hugo  Hernandez   19  Practicante
3  Maria   Gonzalez   22           PM

Seleccionamos a la gente con más de 25 años

In [27]:
df1[df1['edad'] > '25' ]

  Nombre Apellido edad      puesto
0    Ana  Sanchez   26  junior dev
1   Pepe    Lopez   31  Senior dev

Otra opción de lograr este resultado, es pasar la edad a dato numérico, luego hacer el filtrado y eliminar los NaNs

In [28]:
df1['edad'] = pd.to_numeric(df1['edad'])
df1.where(df1['edad'] > 25).dropna()

  Nombre Apellido  edad      puesto
0    Ana  Sanchez  26.0  junior dev
1   Pepe    Lopez  31.0  Senior dev

In [29]:
df1

  Nombre   Apellido  edad       puesto
0    Ana    Sanchez    26   junior dev
1   Pepe      Lopez    31   Senior dev
2   Hugo  Hernandez    19  Practicante
3  Maria   Gonzalez    22           PM

In [31]:
df2 = df1
df2

  Nombre   Apellido  edad       puesto
0    Ana    Sanchez    26   junior dev
1   Pepe      Lopez    31   Senior dev
2   Hugo  Hernandez    19  Practicante
3  Maria   Gonzalez    22           PM

Ahora la operación de proyección, (seleccionar solo algunas columnas)

In [32]:
df1[['Nombre', 'edad']]

  Nombre  edad
0    Ana    26
1   Pepe    31
2   Hugo    19
3  Maria    22

Ahora, juntándo las operaciones, primero la gente con más de 25 años, y luego solo su nombre y edad de ese resultado:

In [33]:

df1.where(df1['edad'] > 25).dropna()[['Nombre', 'edad']]

  Nombre  edad
0    Ana  26.0
1   Pepe  31.0

Para utilizar algunas funciones recientes de pandas, como el merge para hacer el producto, actualizamos pandas a la versión 1.2

In [1]:
!pip install pandas==1.2

Requirement already satisfied: pandas==1.2 in /usr/local/lib/python3.7/dist-packages (1.2.0)
Requirement already satisfied: numpy>=1.16.5 in /usr/local/lib/python3.7/dist-packages (from pandas==1.2) (1.19.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas==1.2) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas==1.2) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas==1.2) (1.15.0)

In [2]:
import pandas as pd 

pd.__version__

'1.2.0'

Veamos un ejemplo de cómo hacer la operación de <h2>unión</h2> Utilizaremos la función concat de pandas para este fin.

In [3]:
df2 = pd.DataFrame(
     {
         "Nombre": ["Raul", "Hector", "Hugo", "Maria"],
         "Apellido": ["Alvarez", "Rojas", "Hernandez", "Gonzalez"],
         "edad": ["41", "37", "19", "22"],
         "puesto": ["Senior dev", "Senior dev", "Practicante", "PM"],
     },
    
 )

In [6]:
df1

  Nombre   Apellido edad       puesto
0    Ana    Sanchez   26   junior dev
1   Pepe      Lopez   31   Senior dev
2   Hugo  Hernandez   19  Practicante
3  Maria   Gonzalez   22           PM

In [7]:
df2

   Nombre   Apellido edad       puesto
0    Raul    Alvarez   41   Senior dev
1  Hector      Rojas   37   Senior dev
2    Hugo  Hernandez   19  Practicante
3   Maria   Gonzalez   22           PM

In [8]:
df3 = pd.concat([df1, df2], ignore_index=True)

In [9]:
df3

   Nombre   Apellido edad       puesto
0     Ana    Sanchez   26   junior dev
1    Pepe      Lopez   31   Senior dev
2    Hugo  Hernandez   19  Practicante
3   Maria   Gonzalez   22           PM
4    Raul    Alvarez   41   Senior dev
5  Hector      Rojas   37   Senior dev
6    Hugo  Hernandez   19  Practicante
7   Maria   Gonzalez   22           PM

In [10]:
#df3 = pd.concat([df1, df2])
#df3 = pd.concat([df1, df2], ignore_index=True)


#df3.drop_duplicates()
#df3.drop_duplicates(inplace=True)
df3.drop_duplicates()
#df3 = df3.drop_duplicates(keep='last')

   Nombre   Apellido edad       puesto
0     Ana    Sanchez   26   junior dev
1    Pepe      Lopez   31   Senior dev
2    Hugo  Hernandez   19  Practicante
3   Maria   Gonzalez   22           PM
4    Raul    Alvarez   41   Senior dev
5  Hector      Rojas   37   Senior dev

In [11]:
df3

   Nombre   Apellido edad       puesto
0     Ana    Sanchez   26   junior dev
1    Pepe      Lopez   31   Senior dev
2    Hugo  Hernandez   19  Practicante
3   Maria   Gonzalez   22           PM
4    Raul    Alvarez   41   Senior dev
5  Hector      Rojas   37   Senior dev
6    Hugo  Hernandez   19  Practicante
7   Maria   Gonzalez   22           PM

Para el operador de <h2>Diferencia</h2> no hay un operador, o una forma directa de hacerlo en pandas, pero se puede hacer de la siguiente manera:

In [12]:
pd.concat([df1, df2, df2]).drop_duplicates(keep=False)

  Nombre Apellido edad      puesto
0    Ana  Sanchez   26  junior dev
1   Pepe    Lopez   31  Senior dev

para el operador de <h2>Producto</h2> de la misma forma que en la diferencia, no tenemos una operacion directa en pandas, pero podemos hacerlo de la siguiente manera :

In [13]:
left = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
right = pd.DataFrame({'col3': [5, 6]})

In [14]:
left

   col1  col2
0     1     3
1     2     4

In [15]:
right

   col3
0     5
1     6

In [16]:
left.merge(right, how='cross')

   col1  col2  col3
0     1     3     5
1     1     3     6
2     2     4     5
3     2     4     6

In [17]:
df1.merge(df2, how='cross')

   Nombre_x Apellido_x edad_x  ... Apellido_y edad_y     puesto_y
0       Ana    Sanchez     26  ...    Alvarez     41   Senior dev
1       Ana    Sanchez     26  ...      Rojas     37   Senior dev
2       Ana    Sanchez     26  ...  Hernandez     19  Practicante
3       Ana    Sanchez     26  ...   Gonzalez     22           PM
4      Pepe      Lopez     31  ...    Alvarez     41   Senior dev
5      Pepe      Lopez     31  ...      Rojas     37   Senior dev
6      Pepe      Lopez     31  ...  Hernandez     19  Practicante
7      Pepe      Lopez     31  ...   Gonzalez     22           PM
8      Hugo  Hernandez     19  ...    Alvarez     41   Senior dev
9      Hugo  Hernandez     19  ...      Rojas     37   Senior dev
10     Hugo  Hernandez     19  ...  Hernandez     19  Practicante
11     Hugo  Hernandez     19  ...   Gonzalez     22           PM
12    Maria   Gonzalez     22  ...    Alvarez     41   Senior dev
13    Maria   Gonzalez     22  ...      Rojas     37   Senior dev
14    Maria   Gonzalez     22  ...  Hernandez     19  Practicante
15    Maria   Gonzalez     22  ...   Gonzalez     22           PM

[16 rows x 8 columns]

Aquí utilizamos la función merge de dataFrame para realizar la operación. Esta operación se comentará con un poco más de detalle más adelante

In [18]:
df1

  Nombre   Apellido edad       puesto
0    Ana    Sanchez   26   junior dev
1   Pepe      Lopez   31   Senior dev
2   Hugo  Hernandez   19  Practicante
3  Maria   Gonzalez   22           PM

En algunos momentos puede ser útil el <h2>Renombrado</h2> de columnas. Puede ser solo para mostrar un dataframe (sin modificarlo), o puede ser que queramos realmente modificar el dataFrame

Veamos un ejemplo

In [19]:
df1

  Nombre   Apellido edad       puesto
0    Ana    Sanchez   26   junior dev
1   Pepe      Lopez   31   Senior dev
2   Hugo  Hernandez   19  Practicante
3  Maria   Gonzalez   22           PM

In [20]:
df1.columns = ['Name','lastname','age','position']
df1

    Name   lastname age     position
0    Ana    Sanchez  26   junior dev
1   Pepe      Lopez  31   Senior dev
2   Hugo  Hernandez  19  Practicante
3  Maria   Gonzalez  22           PM

In [21]:
df1

    Name   lastname age     position
0    Ana    Sanchez  26   junior dev
1   Pepe      Lopez  31   Senior dev
2   Hugo  Hernandez  19  Practicante
3  Maria   Gonzalez  22           PM

Si queremos renombrar solo una(s) columna(s):

In [22]:
df1.rename(columns={'age':'edad', 'position':'puesto'}, inplace=True)

In [23]:
df1

    Name   lastname edad       puesto
0    Ana    Sanchez   26   junior dev
1   Pepe      Lopez   31   Senior dev
2   Hugo  Hernandez   19  Practicante
3  Maria   Gonzalez   22           PM

Ahora veamos las operaciones de <h2>reunion (JOIN)</h2>

In [34]:

dfa = pd.DataFrame(
     {
         "marca": [2, 3, 2, 5, 7],
         "submarca": ["jetta", "cx-5", "polo", "figo", "duster"],
         "modelo": [2006, 2015, 2018, 2020, 2015],
         "kms": [194500, 98000, 56250, 12000, 154000],
     },
     #index=[0, 1, 2, 3],
 )
dfm = pd.DataFrame(
	     {
	         "id_marca": [1,2,3,4,5,6],
	         "marca": ["susuki", "volkswagen", "mazda", "honda", "ford", "toyota"]
           	         
	     },
	     #index=[2, 3, 6, 7],
	 )

In [37]:
dfa

   marca submarca  modelo     kms
0      2    jetta    2006  194500
1      3     cx-5    2015   98000
2      2     polo    2018   56250
3      5     figo    2020   12000
4      7   duster    2015  154000

In [38]:
dfm

   id_marca       marca
0         1      susuki
1         2  volkswagen
2         3       mazda
3         4       honda
4         5        ford
5         6      toyota

In [39]:
autos_marcas=pd.concat([dfa,dfm], axis = 1)
autos_marcas

  marca submarca  modelo       kms  id_marca       marca
0   2.0    jetta  2006.0  194500.0         1      susuki
1   3.0     cx-5  2015.0   98000.0         2  volkswagen
2   2.0     polo  2018.0   56250.0         3       mazda
3   5.0     figo  2020.0   12000.0         4       honda
4   7.0   duster  2015.0  154000.0         5        ford
5   NaN      NaN     NaN       NaN         6      toyota

Esto no tiene mucho sentido. usemos ahora la funcion merge para hacer los joins correctos

In [40]:
dfa.merge(dfm, left_on='marca', right_on='id_marca')

   marca_x submarca  modelo     kms  id_marca     marca_y
0        2    jetta    2006  194500         2  volkswagen
1        2     polo    2018   56250         2  volkswagen
2        3     cx-5    2015   98000         3       mazda
3        5     figo    2020   12000         5        ford

Notemos que la forma de operar por default del merge, haciendo la funcion JOIN del algebra relacional es un <b>inner join</b>. es decir solo muestra como resultado las filas que tienen relacion entre un dataFrame y otro

Veamos cómo quedaría un left join

In [41]:
dfa.merge(dfm, left_on='marca', right_on='id_marca', how = 'left')

   marca_x submarca  modelo     kms  id_marca     marca_y
0        2    jetta    2006  194500       2.0  volkswagen
1        3     cx-5    2015   98000       3.0       mazda
2        2     polo    2018   56250       2.0  volkswagen
3        5     figo    2020   12000       5.0        ford
4        7   duster    2015  154000       NaN         NaN

Ahora un right join

In [ ]:
dfa.merge(dfm, left_on='marca', right_on='id_marca', how = 'right')

   marca_x submarca  modelo       kms  id_marca     marca_y
0      NaN      NaN     NaN       NaN         1      susuki
1      2.0    jetta  2006.0  194500.0         2  volkswagen
2      2.0     polo  2018.0   56250.0         2  volkswagen
3      3.0     cx-5  2015.0   98000.0         3       mazda
4      NaN      NaN     NaN       NaN         4       honda
5      5.0     figo  2020.0   12000.0         5        ford
6      NaN      NaN     NaN       NaN         6      toyota

Finalmente un outer

In [ ]:
dfa.merge(dfm, left_on='marca', right_on='id_marca', how = 'outer')

   marca_x submarca  modelo       kms  id_marca     marca_y
0      2.0    jetta  2006.0  194500.0       2.0  volkswagen
1      2.0     polo  2018.0   56250.0       2.0  volkswagen
2      3.0     cx-5  2015.0   98000.0       3.0       mazda
3      5.0     figo  2020.0   12000.0       5.0        ford
4      7.0   duster  2015.0  154000.0       NaN         NaN
5      NaN      NaN     NaN       NaN       1.0      susuki
6      NaN      NaN     NaN       NaN       4.0       honda
7      NaN      NaN     NaN       NaN       6.0      toyota


<h1> Uso de las funciones concat append, merge y join de pandas</h1>

<h1>uso de concat()</h1>

Ejemplo de concat para unir dataframes. Se muestra el uso del operador UNION con mismo esquema

In [ ]:
import pandas as pd

In [ ]:
df1 = pd.DataFrame(
     {
         "A": ["A0", "A1", "A2", "A3"],
         "B": ["B0", "B1", "B2", "B3"],
         "C": ["C0", "C1", "C2", "C3"],
         "D": ["D0", "D1", "D2", "D3"],
     },
     index=[0, 1, 2, 3],
 )
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[0, 1, 2, 3],
  )
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [ ]:
df3 = pd.DataFrame(
     {
         "A": ["A8", "A9", "A10", "A11"],
         "B": ["B8", "B9", "B10", "B11"],
         "C": ["C8", "C9", "C10", "C11"],
         "D": ["D8", "D9", "D10", "D11"],
     },
     index=[0, 1, 2, 3],
 )
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [ ]:
frames = [df1, df2, df3]

result = pd.concat(frames)

In [ ]:
result

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [ ]:
result = result.reset_index(drop=True)

In [ ]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

<h1>Uso de append()</h1>

Ahora veamos el uso de append. Esto es otro ejemplo del operador UNION del Algebra relacional

In [ ]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
df

   A  B
0  1  2
1  3  4

In [ ]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=['A','B'])
df2

   A  B
0  5  6
1  7  8

In [ ]:
df.append(df2)

   A  B
0  1  2
1  3  4
0  5  6
1  7  8

In [ ]:
df.append(df2, ignore_index=True)

   A  B
0  1  2
1  3  4
2  5  6
3  7  8

<h1>Uso de merge()</h1>

Ahora veamos como funciona la funcióón merge en pandas

In [ ]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],

                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],

                    'value': [5, 6, 7, 8]})

In [ ]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [ ]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

Apliquemos la función merge al DataFrame 1 con el DataFrame 2 utilizando como llaves las columans lkey y rkey

In [ ]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Veamos ahora un ejemplo más útil

In [ ]:
df1 = pd.DataFrame({'lkey': ['uno', 'dos', 'tres', 'cuatro'], 'value': [1, 2, 3, 5]})                  

df2 = pd.DataFrame({'rkey': ['tres', 'uno', 'dos', 'cuatro'], 'value': [5, 6, 7, 8]})

In [ ]:
df1

     lkey  value
0     uno      1
1     dos      2
2    tres      3
3  cuatro      5

In [ ]:
df2

     rkey  value
0    tres      5
1     uno      6
2     dos      7
3  cuatro      8

In [ ]:
df1.merge(df2, left_on='lkey', right_on='rkey')

     lkey  value_x    rkey  value_y
0     uno        1     uno        6
1     dos        2     dos        7
2    tres        3    tres        5
3  cuatro        5  cuatro        8

Hay que notar que las columnas "value" han sido renombreadas con un sufijo. Esto es para evitar nombres de columnas duplicadas.

Si quisieramos pedirle a pandas que no renombrara las columnas con sufijos, esto generaría un error

In [ ]:
df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=('left', 'right'))

  lkey  valueleft rkey  valueright
0  foo          1  foo           5
1  foo          1  foo           8
2  foo          5  foo           5
3  foo          5  foo           8
4  bar          2  bar           6
5  baz          3  baz           7

Ahora veamos un ejemplo de la función merge usada como la función JOIN del Algebra Relacional

In [ ]:
df1 = pd.DataFrame({'a': ['uno', 'dos'], 'b': [1, 2]})

In [ ]:
df2 = pd.DataFrame({'a': ['dos', 'tres'], 'c': [3, 4]})

In [ ]:
df1

     a  b
0  uno  1
1  dos  2

In [ ]:
df2

      a  c
0   dos  3
1  tres  4

In [ ]:
df1.merge(df2, how='inner', on='a')

     a  b  c
0  dos  2  3

In [ ]:
df1.merge(df2, how='left', on='a')

     a  b    c
0  uno  1  NaN
1  dos  2  3.0

In [ ]:
df1.merge(df2, how='right', on='a')

      a    b  c
0   dos  2.0  3
1  tres  NaN  4

In [ ]:
df1.merge(df2, how='outer', on='a')

      a    b    c
0   uno  1.0  NaN
1   dos  2.0  3.0
2  tres  NaN  4.0

<h1>Uso de join()</h1>

Ahora revisaremos un ejemplo del uso de la funcion join()

Primero creamos un DataFrame

In [ ]:
df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],

                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

In [ ]:
df

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

Luego creamos otro, pero que contenga ahora menos renglones

In [ ]:
other = pd.DataFrame({'key': ['K1', 'K0', 'K2'],

                      'B': ['B0', 'B1', 'B2']})

In [ ]:
other

  key   B
0  K1  B0
1  K0  B1
2  K2  B2

Ahora haremos el <b>join</b> sobre las llaves, agregaremos los sufijos "caller" para ejemplificar quien es el DataFrame que hace la llamada a la función join, y el sufijo "other" para mostrar quien es el DataFrame que esta siendo usado como referencia o parámetro

In [ ]:
df.join(other, lsuffix='_caller', rsuffix='_other')

  key_caller   A key_other    B
0         K0  A0        K1   B0
1         K1  A1        K0   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN

Otra forma de hacer esto, que es parecida a un "outer join", es especificando los índices de cada DataFrame

In [ ]:
df.join(other.set_index('key'), on='key')

  key   A    B
0  K0  A0   B1
1  K1  A1   B0
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN